samples/personal-info/out/rdra_buc_profile.puml
@startuml
!theme plain

actor "User" as User

usecase "Delete Address" as DeleteAddress
usecase "Register Address" as RegisterAddress
usecase "Set Primary Address" as SetPrimaryAddress
usecase "Update Address" as UpdateAddress
usecase "Update Personal Information" as UpdateProfile
usecase "View Personal Information" as ViewProfile

rectangle "Manage Personal Information" as BucProfile



database "Audit Log" as AuditLog
database "Personal Information" as PersonalInfo
database "Postal Address" as PostalAddress
database "User Account" as UserAccount

boundary "Address Edit Screen" as AddressEditScreen
boundary "Address List Screen" as AddressListScreen
boundary "Personal Information Screen" as ProfileScreen



User --> BucProfile
BucProfile ..> PersonalDataMgmt : belongs
BucProfile ..> ViewProfile : contains
BucProfile ..> UpdateProfile : contains
BucProfile ..> RegisterAddress : contains
BucProfile ..> UpdateAddress : contains
BucProfile ..> DeleteAddress : contains
BucProfile ..> SetPrimaryAddress : contains
PersonalInfo -- UserAccount
PostalAddress -- UserAccount
AuditLog -- UserAccount
ViewProfile ..> ProfileScreen : displays
UpdateProfile ..> ProfileScreen : displays
RegisterAddress ..> AddressEditScreen : displays
UpdateAddress ..> AddressEditScreen : displays
DeleteAddress ..> AddressListScreen : displays
SetPrimaryAddress ..> AddressListScreen : displays
@enduml
